# Add proportional income tax (from documentation)
hledger print -f- --auto
<<<
2016/1/1 paycheck
    income:remuneration     $-100
    income:donations         $-15
    assets:bank

2016/1/1 withdraw
    assets:cash             $20
    assets:bank

= ^income
  (liabilities:tax)  *.33  ; income tax
>>>
2016/01/01 paycheck
    income:remuneration           $-100
    (liabilities:tax)              $-33    ; income tax
    income:donations               $-15
    (liabilities:tax)               $-5    ; income tax
    assets:bank

2016/01/01 withdraw
    assets:cash             $20
    assets:bank

>>>2
>>>=0

hledger register -f- --auto
<<<
2016/1/1 paycheck
    income:remuneration     $-100
    income:donations         $-15
    assets:bank

2016/1/1 withdraw
    assets:cash             $20
    assets:bank

= ^income
  (liabilities:tax)  *.33  ; income tax
>>>
2016/01/01 paycheck             income:remuneration          $-100         $-100
                                (liabilities:tax)             $-33         $-133
                                income:donations              $-15         $-148
                                (liabilities:tax)              $-5         $-153
                                assets:bank                   $115          $-38
2016/01/01 withdraw             assets:cash                    $20          $-18
                                assets:bank                   $-20          $-38
>>>2
>>>=0

hledger register -f- --auto
<<<
= trigger
  (target)   10

2018/1/1
  (trigger)   1
  (target)    1    = 11  ; this assertion would not fail, auto posting will be taken into account
>>>
2018/01/01                      (trigger)                        1             1
                                (target)                        10            11
                                (target)                         1            12
>>>2
>>>=0

hledger balance -f- --auto
<<<
2016/1/1 paycheck
    income:remuneration     $-100
    income:donations         $-15
    assets:bank

2016/1/1 withdraw
    assets:cash             $20
    assets:bank

= ^income
  (liabilities:tax)  *.33  ; income tax
>>>
                $115  assets
                 $95    bank
                 $20    cash
               $-115  income
                $-15    donations
               $-100    remuneration
                $-38  liabilities:tax
--------------------
                $-38
>>>2
>>>=0

hledger print -f- --auto
<<<
= ^expenses:groceries
    [budget:groceries]                           *-1
    [assets:bank:checking]                        *1

2018/10/7 * MARKET
    expenses:groceries:food
    assets:bank:checking                         $-20
>>>
2018/10/07 * MARKET
    expenses:groceries:food
    [budget:groceries]                 $-20
    [assets:bank:checking]              $20
    assets:bank:checking               $-20

>>>2
>>>=0

hledger print -f- --auto
<<<
= ^expenses:foo
    budget:available   *-1
    assets:checking     *1

2018/10/17 * INITIAL
    budget:available   $100
    equity:opening

2018/10/17 * SOME EXPENSE
    expenses:foo                                 $50
    assets:checking

2018/10/17 * ASSERT
    budget:other
    budget:available                              =$0
>>>
>>>2
hledger: cannot assign amount to account 

    budget:available

because it is also included in transaction modifiers.

>>>=1

hledger print -f- --auto
<<<
= ^expenses:foo
    budget:available   *-1
    assets:checking     *1

2018/10/17 * INITIAL
    budget:available   $100
    equity:opening

2018/10/17 * SOME EXPENSE
    expenses:foo                                 $50
    assets:checking

2018/10/17 * ASSERT
    budget:other
    budget:available                            $-50=$0
>>>
2018/10/17 * INITIAL
    budget:available            $100
    equity:opening

2018/10/17 * SOME EXPENSE
    expenses:foo                 $50
    budget:available            $-50
    assets:checking              $50
    assets:checking

2018/10/17 * ASSERT
    budget:other
    budget:available            $-50 = $0

>>>2
>>>=0
